SS-Electronics/FreeRTOS-KERNEL/devices/stm32_f401xx_irq.c

#include "stm32_f401xx_irq.h"

__WEAK void  NMI_Handler(void)
{
    while(1)
    {
        
    }
}

__WEAK void HardFault_Handler(void)
{
    while(1)
    {
        
    }
}

__WEAK void MemManage_Handler(void)
{
    while(1)
    {
        
    }
}

__WEAK void BusFault_Handler(void)
{
    while(1)
    {
        
    }
}

__WEAK void UsageFault_Handler(void)
{
    while(1)
    {
        
    }
}

__WEAK void DebugMon_Handler(void)
{
    while(1)
    {
        
    }
};

__WEAK void SVC_Handler(void)
{

}


__WEAK void PendSV_Handler(void)
{

}

__WEAK void SysTick_Handler(void)
{

}

__WEAK void WWDG_IRQHandler(void)
{

}

__WEAK void PVD_IRQHandler(void)
{

}

__WEAK void TAMP_STAMP_IRQHandler(void)
{

}

__WEAK void RTC_WKUP_IRQHandler(void)
{

}

__WEAK void FLASH_IRQHandler(void)
{

}

__WEAK void RCC_IRQHandler(void)
{

}

__WEAK void EXTI0_IRQHandler(void)
{

}

__WEAK void EXTI1_IRQHandler(void)
{

}

__WEAK void EXTI2_IRQHandler(void)
{

}

__WEAK void EXTI3_IRQHandler(void)
{

}

__WEAK void EXTI4_IRQHandler(void)
{

}

__WEAK void DMA1_Stream0_IRQHandler(void)
{

}

__WEAK void DMA1_Stream1_IRQHandler(void)
{

}


__WEAK void DMA1_Stream2_IRQHandler(void)
{

}

__WEAK void DMA1_Stream3_IRQHandler(void)
{

}

__WEAK void DMA1_Stream4_IRQHandler(void)
{

}

__WEAK void DMA1_Stream5_IRQHandler(void)
{

}

__WEAK void DMA1_Stream6_IRQHandler(void)
{

}


__WEAK void DMA1_Stream7_IRQHandler(void)
{

}


__WEAK void DMA2_Stream0_IRQHandler(void)
{

}

__WEAK void DMA2_Stream1_IRQHandler(void)
{

}

__WEAK void DMA2_Stream2_IRQHandler(void)
{

}

__WEAK void DMA2_Stream3_IRQHandler(void)
{

}

__WEAK void DMA2_Stream4_IRQHandler(void)
{

}


__WEAK void DMA2_Stream5_IRQHandler(void)
{

}

__WEAK void DMA2_Stream6_IRQHandler(void)
{

}

__WEAK void DMA2_Stream7_IRQHandler(void)
{

}

__WEAK void EXTI9_5_IRQHandler(void)
{

}

__WEAK void ADC_IRQHandler(void)
{

}

__WEAK void TIM1_BRK_TIM9_IRQHandler(void)
{

}


__WEAK void TIM1_UP_TIM10_IRQHandler(void)
{

}

__WEAK void TIM1_TRG_COM_TIM11_IRQHandler(void)
{

}

__WEAK void TIM1_CC_IRQHandler(void)
{

}

__WEAK void TIM2_IRQHandler(void)
{

}

__WEAK void TIM3_IRQHandler(void)
{

}

__WEAK void TIM4_IRQHandler(void)
{

}

__WEAK void I2C1_EV_IRQHandler(void)
{

}

__WEAK void I2C1_ER_IRQHandler(void)
{

}

__WEAK void I2C2_EV_IRQHandler(void)
{

}

__WEAK void I2C2_ER_IRQHandler(void)
{

}

__WEAK void SPI1_IRQHandler(void)
{

}

__WEAK void SPI2_IRQHandler(void)
{

}

__WEAK void USART1_IRQHandler(void)
{

}

__WEAK void USART2_IRQHandler(void)
{

}

__WEAK void EXTI15_10_IRQHandler(void)
{

}

__WEAK void RTC_Alarm_IRQHandler(void)
{

}

__WEAK void OTG_FS_WKUP_IRQHandler(void)
{

}

__WEAK void SDIO_IRQHandler(void)
{

}

__WEAK void TIM5_IRQHandler(void)
{


}

__WEAK void SPI3_IRQHandler(void)
{

}

__WEAK void OTG_FS_IRQHandler(void)
{

}

__WEAK void I2C3_EV_IRQHandler(void)
{

}

__WEAK void I2C3_ER_IRQHandler(void)
{

}

__WEAK void FPU_IRQHandler(void)
{

}

__WEAK void SPI4_IRQHandler(void)
{


}